In [1]:
import pandas as pd
import numpy as np

In [94]:
log = pd.read_csv('log.csv', header=None, names=['user_id', 'time', 'bet', 'win'])
log.head()

                            user_id                  time  bet  win
0  Запись пользователя № - user_919  [2019-01-01 14:06:51  NaN  NaN
1  Запись пользователя № - user_973  [2019-01-01 14:51:16  NaN  NaN
2  Запись пользователя № - user_903  [2019-01-01 16:31:16  NaN  NaN
3  Запись пользователя № - user_954  [2019-01-01 17:17:51  NaN  NaN
4  Запись пользователя № - user_954  [2019-01-01 21:31:18  NaN  NaN

In [31]:
log['time'].isna().sum()

15

In [48]:
log_cols = log
log.index
log_cols = log_cols.dropna(axis=1, subset=log_cols.index)
log_cols.shape

(1000, 1)

In [50]:
log_rows = log
log_rows = log_rows.dropna(axis=0, subset=log_rows.columns)
log_rows.shape

(133, 4)

In [80]:
log_ut = log

if log_ut['user_id'].isna().any():
    log_ut = log_ut.drop('user_id', axis=1)

if log_ut['time'].isna().any():
    log_ut = log_ut.drop('time', axis=1)

log_ut.shape

(1000, 3)

In [93]:
log_dup = log.drop_duplicates(subset=['time', 'user_id'])
log_dup.shape

(986, 4)

In [127]:
log_time = log
log_time = log_time.dropna(axis=0, subset=['time'])
log_time.loc[:, 'time'] = log_time.loc[:, 'time'].apply(lambda x: x[1:])
log_time.head()

/home/pavlk/APPS/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1745: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(ilocs[0], value)

                            user_id                 time  bet  win
0  Запись пользователя № - user_919  2019-01-01 14:06:51  NaN  NaN
1  Запись пользователя № - user_973  2019-01-01 14:51:16  NaN  NaN
2  Запись пользователя № - user_903  2019-01-01 16:31:16  NaN  NaN
3  Запись пользователя № - user_954  2019-01-01 17:17:51  NaN  NaN
4  Запись пользователя № - user_954  2019-01-01 21:31:18  NaN  NaN

In [128]:
log_time.time = pd.to_datetime(log_time['time'])
log_time.time.head()

/home/pavlk/APPS/anaconda3/lib/python3.8/site-packages/pandas/core/generic.py:5168: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

0   2019-01-01 14:06:51
1   2019-01-01 14:51:16
2   2019-01-01 16:31:16
3   2019-01-01 17:17:51
4   2019-01-01 21:31:18
Name: time, dtype: datetime64[ns]

In [144]:
import datetime

log_time.time.sort_values(ascending=False).iloc[0].date().isoformat()

'2019-04-20'

In [148]:
log_time.time.dt.minute.value_counts().head()

36    25
31    23
6     22
50    22
43    21
Name: time, dtype: int64

In [151]:
log_time.time.dt.month.value_counts(ascending=True).head()

4    170
2    259
3    264
1    292
Name: time, dtype: int64

In [164]:
log_time.loc[log_time['time'].dt.weekday >= 5, ['time']]
# sum(log_time['time'].dt.weekday >= 5)

                   time
39  2019-01-05 01:54:07
40  2019-01-05 10:44:56
41  2019-01-05 13:13:21
42  2019-01-05 14:36:15
43  2019-01-05 18:09:15
..                  ...
991 2019-04-20 12:55:41
992 2019-04-20 14:59:36
993 2019-04-20 17:09:56
994 2019-04-20 18:10:07
995 2019-04-20 09:59:58

[283 rows x 1 columns]

In [166]:
def totd(dt:datetime):
    if dt.hour <= 5:
        return 'ночь'
    elif dt.hour <= 11:
        return 'утро'
    elif dt.hour <= 17:
        return 'день'
    else:
        return 'вечер'
    
log_time['время суток'] = log_time['time'].apply(totd)
log_time.head()

<ipython-input-166-18b236df2d2a>:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  log_time['время суток'] = log_time['time'].apply(totd)

                            user_id                time  bet  win время суток
0  Запись пользователя № - user_919 2019-01-01 14:06:51  NaN  NaN        день
1  Запись пользователя № - user_973 2019-01-01 14:51:16  NaN  NaN        день
2  Запись пользователя № - user_903 2019-01-01 16:31:16  NaN  NaN        день
3  Запись пользователя № - user_954 2019-01-01 17:17:51  NaN  NaN        день
4  Запись пользователя № - user_954 2019-01-01 21:31:18  NaN  NaN       вечер

In [169]:
log_time['время суток'].value_counts(ascending=True)

вечер    227
день     240
утро     253
ночь     265
Name: время суток, dtype: int64

### Задание 11.4.5

In [178]:
log = pd.read_csv('log.csv', names=['user_id', 'time', 'bet', 'win'])
log = log.dropna(axis=0)
log.shape

(133, 4)

In [179]:
log['time'] = log.time.apply(lambda x: x[1:])

In [182]:
log['time'] = pd.to_datetime(log.time)

In [184]:
log['hour'] = log.time.dt.hour

In [188]:
log[['time', 'hour']]

                   time  hour
14  2019-01-02 08:57:36     8
29  2019-01-04 13:59:42    13
151 2019-01-16 21:54:22    21
189 2019-01-21 18:34:44    18
205 2019-01-22 05:26:59     5
..                  ...   ...
967 2019-04-19 22:25:15    22
971 2019-04-20 10:35:49    10
972 2019-04-20 10:35:50    10
976 2019-04-20 10:35:54    10
991 2019-04-20 12:55:41    12

[133 rows x 2 columns]

### Продолжаем работать с пропусками

In [346]:
log = pd.read_csv('log.csv', names=['user_id', 'time', 'bet', 'win'])
log.head()

                            user_id                  time  bet  win
0  Запись пользователя № - user_919  [2019-01-01 14:06:51  NaN  NaN
1  Запись пользователя № - user_973  [2019-01-01 14:51:16  NaN  NaN
2  Запись пользователя № - user_903  [2019-01-01 16:31:16  NaN  NaN
3  Запись пользователя № - user_954  [2019-01-01 17:17:51  NaN  NaN
4  Запись пользователя № - user_954  [2019-01-01 21:31:18  NaN  NaN

In [428]:
log.bet = log.bet.fillna(0)

In [348]:
log.bet.value_counts().head()

0.0      515
500.0     50
100.0     48
300.0     42
800.0     42
Name: bet, dtype: int64

In [349]:
def fillna_win(row):
    if not row['bet']:
        return 0
    elif row['bet'] and not row['win']:
        return -row['bet']
    else:
        return row['win']

In [350]:
log['win'] = log.win.fillna(0)
log['new_win'] = log.apply(lambda row: fillna_win(row), axis=1)
log['win'] = log['new_win']

In [351]:
sum(log['win'] < 0)

347

#### Python 11.6

In [352]:
def calc_net(row):
    if row['win'] < 0:
        return row['win']
    else:
        return row['win'] - row['bet']

In [353]:
log['net'] = log.apply(lambda row: calc_net(row), axis=1)

In [354]:
log.loc[log.net > 0].shape

(138, 6)

In [355]:
log.loc[log.net > 0, ['net']].mean()

net    80253.333333
dtype: float64

In [356]:
log.loc[log.net > 0, ['net']].median()

net    5347.0
dtype: float64

In [357]:
log.bet.mean()
log.bet.sum()/log.bet.dropna().shape[0]
log.bet.dropna().mean()

3291.083

In [363]:
sum(log.bet > 0)/log.shape[0]*100

48.5

In [366]:
log.loc[log.bet > 0, 'bet'].mean()

6785.738144329897

In [368]:
log.loc[log.bet > 0, 'net'].mean()

20421.892783505155

In [371]:
log.loc[log.net < 0, 'net'].mean()

-3372.743515850144

In [373]:
log.loc[log.bet > 0].shape[0]

485

In [377]:
log.loc[log.net > 0].shape[0]/log.loc[log.bet > 0].shape[0]
# log.loc[log.net < 0].shape/log.loc[log.bet > 0].shape[0]

0.2845360824742268

In [387]:
log = pd.read_csv('log.csv', names=['user_id', 'time', 'bet', 'win'])
min_bet_amount = log.loc[log.bet == log.loc[log.bet > 0, 'bet'].min(), 'bet'].count()

#### Python 11.8

In [503]:
log = pd.read_csv('log.csv', names=['user_id', 'time', 'bet', 'win'])
us = pd.read_csv('users.csv', encoding='koi8-r', header=0, sep='\t', names=['user_id', 'email', 'city'])
us.head()

    user_id                email       city
0  User_943  Accumanst@gmail.com     Ижевск
1  User_908    Advismowr@mail.ru     Ижевск
2  User_962      Anachso@ukr.net  Краснодар
3  User_973     Antecia@inbox.ru      Пермь
4  User_902   Balliaryva@ukr.net        NaN

In [504]:
# Приведем признак user_id к одному формату в обоих датасетах
us.user_id = us.user_id.apply(lambda x: x.lower())
# Избавимся от ошибок в user_id
log = log[log.user_id != '#error']
log.user_id = log.user_id.str.split(' - ').apply(lambda x: x[1])

In [505]:
df = pd.merge(log, us, on='user_id')

In [506]:
df.groupby('user_id').win.median().median()

5951.75

In [507]:
df.bet = df.bet.fillna(0)
df['win'] = df.win.fillna(0)
df['new_win'] = df.apply(lambda row: fillna_win(row), axis=1)
df['win'] = df['new_win']
df.head()

,user_id,time,bet,win,email,city,new_win
0,user_919,[2019-01-01 14:06:51,0.0,0.0,Chikkaverle@icloud.com,Хабаровск,0.0
1,user_919,[2019-01-30 10:06:00,0.0,0.0,Chikkaverle@icloud.com,Хабаровск,0.0
2,user_919,[2019-02-05 14:33:44,0.0,0.0,Chikkaverle@icloud.com,Хабаровск,0.0
3,user_919,[2019-02-14 11:38:05,0.0,0.0,Chikkaverle@icloud.com,Хабаровск,0.0
4,user_919,[2019-03-02 4:23:36,300.0,-300.0,Chikkaverle@icloud.com,Хабаровск,-300.0

In [508]:
df['net'] = df.apply(lambda row: calc_net(row), axis=1)

In [509]:
df.head()

,user_id,time,bet,win,email,city,new_win,net
0,user_919,[2019-01-01 14:06:51,0.0,0.0,Chikkaverle@icloud.com,Хабаровск,0.0,0.0
1,user_919,[2019-01-30 10:06:00,0.0,0.0,Chikkaverle@icloud.com,Хабаровск,0.0,0.0
2,user_919,[2019-02-05 14:33:44,0.0,0.0,Chikkaverle@icloud.com,Хабаровск,0.0,0.0
3,user_919,[2019-02-14 11:38:05,0.0,0.0,Chikkaverle@icloud.com,Хабаровск,0.0,0.0
4,user_919,[2019-03-02 4:23:36,300.0,-300.0,Chikkaverle@icloud.com,Хабаровск,-300.0,-300.0

In [510]:
df.groupby('user_id').net.sum().median()

1986.0

In [511]:
sum(df.groupby('user_id').bet.sum() > 0)  # equals 100
df.groupby('user_id').count().count().email
df.loc[df.bet == 0].count()

user_id    505
time       505
bet        505
win        505
email      499
city       492
new_win    505
net        505
dtype: int64

In [512]:
df['time'] = df.time.apply(lambda x: x[1:])

In [513]:
df['time'] = pd.to_datetime(df.time)

In [514]:
df.loc[(df.user_id == 'user_1000') & (df.bet == 0)].time.min()-df.loc[(df.user_id == 'user_1000') & (df.bet > 0)].time.min()

Timedelta('-8 days +22:33:57')

In [515]:
df.groupby('user_id').apply(lambda x: x[x.bet > 0].time.min() - x[x.bet == 0].time.min()).sum() / 100

Timedelta('46 days 06:54:48')

In [516]:
df.groupby('city').win.sum().sort_values(ascending=False)

city
Москва             11379755.0
Воронеж              107514.0
Санкт-Петербург      105345.0
Казань                75352.0
Ярославль             46845.0
Ижевск                34479.0
Хабаровск             33451.0
Екатеринбург          28582.0
Красноярск            27397.0
Арзангелтск           25813.0
Пермь                 19518.0
Краснодар              3248.0
Ставрополь              487.0
Тюмень                 -499.0
Name: win, dtype: float64

In [530]:
df.loc[df['bet'] > 0, ['city', 'bet']].groupby('city').bet.mean().max()/df.loc[df['bet'] > 0, ['city', 'bet']].groupby('city').bet.mean().min()

127.81602335164835

In [541]:
import pandas as pd

log = pd.read_csv('log.csv', names=['user_id', 'time', 'bet', 'win'])
us = pd.read_csv('users.csv', encoding='koi8-r', header=0, sep='\t', names=['user_id', 'email', 'city'])

log = log[log['user_id'] != '#error']
log['user_id'] = log.user_id.str.split(' - ').apply(lambda x: x[1])

us['user_id'] = us.user_id.apply(lambda x: str(x).lower())

df = pd.merge(log, us, on='user_id')

sample2 = df.groupby('city').time.count()

In [542]:
sample2

city
Арзангелтск         96
Воронеж             88
Екатеринбург        49
Ижевск              61
Казань              66
Краснодар           86
Красноярск          56
Москва              61
Пермь               55
Санкт-Петербург    115
Ставрополь          36
Тюмень              32
Хабаровск           60
Ярославль           89
Name: time, dtype: int64